<template>
  <div class="row">
    <div class="col-1">
      <div class="d-flex flex-column gap-3 text-center bg-component align-items-center rounded-4 py-4">
        <circle-button-box v-for="(item, index) in data?.content" :key="index"
                           @click="this.pageIndex = index" :class="pageIndex === index ? 'active' : ''"
                           :title="setPage(index)"/>
      </div>
    </div>

    <div class="col-11">
      <div class="card p-3">
        <div v-html="data?.title" class="card-title"></div>
        <div v-html="data?.text" class="mb-4"></div>
        <div class="overflow-auto">
          <div
              v-if="data?.content[pageIndex]"
              v-html="data.content[pageIndex]"
              class="d-grid mb-3 gap-3">
          </div>
        </div>
        <div class="card-footer d-flex justify-content-between align-items-center mt-2">
          <a href="mailto:help@wallone.ru" class="fs-16">help@wallone.ru</a>
          <p class="fs-16 date-updated">Обновлено: 01/01/2002</p>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
import CircleButtonBox from "@/components/elements/CircleButtonBox";

import {useHead} from "@unhead/vue";
// import apiRouter from "@/router/api";

export default {
  name: "PrivacyStatementView",
  components: {CircleButtonBox},

  data() {
    return {
      data: {
        "title": "<h1>Политика конфиденциальности персональных данных</h1>",
        "text": "<p>Настоящая Политика конфиденциальности персональных данных (далее – Политика конфиденциальности) действует в отношении всей информации, которую сайт&nbsp;<strong>Wallone</strong>, (далее – Wallone) расположенный на доменном имени&nbsp;<strong>https://wallone.ru</strong>&nbsp;(а также его субдоменах), может получить о Пользователе во время использования сайта https://wallone.ru (а также его субдоменов), его программ и его продуктов.</p>",
        "content": {
          "0": ["<h2>1. Определение терминов</h2>\n                    <h3>1.1 В настоящей Политике конфиденциальности используются следующие термины:</h3>\n                    <p>1.1.1.&nbsp;<strong>«Администрация сайта»</strong>&nbsp;(далее – Администрация) – уполномоченные сотрудники на управление сайтом Wallone, которые организуют и (или) осуществляют обработку персональных данных, а также определяет цели обработки персональных данных, состав персональных данных, подлежащих обработке, действия (операции), совершаемые с персональными данными.</p>\n                    <p>1.1.2.&nbsp;<strong>«Персональные данные»</strong>&nbsp;- любая информация, относящаяся к прямо или косвенно определенному, или определяемому физическому лицу (субъекту персональных данных).</p>\n                    <p>1.1.3.&nbsp;<strong>«Обработка персональных данных»</strong>&nbsp;- любое действие (операция) или совокупность действий (операций), совершаемых с использованием средств автоматизации или без использования таких средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных.</p>\n                    <p>1.1.4.&nbsp;<strong>«Конфиденциальность персональных данных»</strong>&nbsp;- обязательное для соблюдения Оператором или иным получившим доступ к персональным данным лицом требование не допускать их распространения без согласия субъекта персональных данных или наличия иного законного основания.</p>\n                    <p>1.1.5.&nbsp;<strong>«Сайт Wallone»</strong>&nbsp;- это совокупность связанных между собой веб-страниц, размещенных в сети Интернет по уникальному адресу (URL): https://wallone.ru, а также его субдоменах.</p>\n                    <p>1.1.6.&nbsp;<strong>«Субдомены»</strong>&nbsp;- это страницы или совокупность страниц, расположенные на доменах третьего уровня, принадлежащие сайту Wallone, а также другие временные страницы, внизу который указана контактная информация Администрации.</p>\n                    <p>1.1.7.&nbsp;<strong>«Cookies»</strong>&nbsp;— небольшой фрагмент данных, отправленный веб-сервером и хранимый на компьютере пользователя, который веб-клиент или веб-браузер каждый раз пересылает веб-серверу в HTTP-запросе при попытке открыть страницу соответствующего сайта.</p>\n                    <p>1.1.8.&nbsp;<strong>«IP-адрес»</strong>&nbsp;— уникальный сетевой адрес узла в компьютерной сети, через который Пользователь получает доступ на Wallone.</p>"],
          "1": ["<h2>2. Общие положения</h2>\n                    <p>2.1. Использование сайта Wallone Пользователем означает согласие с настоящей Политикой конфиденциальности и условиями обработки персональных данных Пользователя.</p>\n                    <p>2.2. В случае несогласия с условиями Политики конфиденциальности Пользователь должен прекратить использование сайта Wallone.</p>\n                    <p>2.3. Настоящая Политика конфиденциальности применяется к сайту Wallone. Wallone не контролирует и не несет ответственность за сайты третьих лиц, на которые Пользователь может перейти по ссылкам, доступным на сайте Wallone.</p>\n                    <p>2.4. Администрация не проверяет достоверность персональных данных, редоставляемых Пользователем.</p>"],
          "2": ["<h2>3. Предмет политики конфиденциальности</h2>\n                    <p>3.1. Настоящая Политика конфиденциальности устанавливает обязательства Администрации по неразглашению и обеспечению режима защиты конфиденциальности персональных данных, которые Пользователь предоставляет по запросу Администрации при регистрации на сайте Wallone или при подписке на информационную e-mail рассылку.</p>\n                    <p>3.2. Персональные данные, разрешённые к обработке в рамках настоящей Политики конфиденциальности, предоставляются Пользователем путём заполнения форм на сайте Wallone и включают в себя следующую информацию:</p>\n                    <p>3.2.1. Никнейм пользователя;</p>\n                    <p>3.2.2. адрес электронной почты (e-mail);</p>\n                    <p>3.2.3. фотографию (при необходимости).</p>\n                    <p>3.3. Wallone защищает Данные, которые автоматически передаются при посещении страниц:</p>\n                    <p>- IP адрес;</p>\n                    <p>- информация из cookies;</p>\n                    <p>- информация о браузере;</p>\n                    <p>- время доступа;</p>\n                    <p>- реферер (адрес предыдущей страницы).</p>\n                    <p>3.3.1. Отключение cookies может повлечь невозможность доступа к частям сайта, требующим авторизации.</p>\n                    <p>3.3.2. Wallone осуществляет сбор статистики об IP-адресах своих посетителей. Данная информация используется с целью предотвращения, выявления и решения технических проблем.</p>\n                    <p>3.4. Любая иная персональная информация неоговоренная выше (история посещения, используемые браузеры, операционные системы и т.д.) подлежит надежному хранению и нераспространению, за исключением случаев, предусмотренных в п.п. 5.2. настоящей Политики конфиденциальности.</p>"],
          "3": ["<h2>4. Цели сбора персональной информации пользователя</h2>\n                    <p><strong>4.1. Персональные данные Пользователя Администрация может использовать в целях:</strong></p>\n                    <p>4.1.1. Идентификации Пользователя, зарегистрированного на сайте Wallone для его дальнейшей авторизации.</p>\n                    <p>4.1.2. Предоставления Пользователю доступа к персонализированным данным сайта Wallone.</p>\n                    <p>4.1.3. Установления с Пользователем обратной связи, включая направление уведомлений, запросов, касающихся использования сайта Wallone, обработки запросов и заявок от Пользователя.</p>\n                    <p>4.1.4. Определения места нахождения Пользователя для обеспечения безопасности, предотвращения мошенничества.</p>\n                    <p>4.1.5. Подтверждения достоверности и полноты персональных данных, предоставленных Пользователем.</p>\n                    <p>4.1.6. Создания учетной записи для использования частей сайта Wallone, если Пользователь дал согласие на создание учетной записи.</p>\n                    <p>4.1.7. Уведомления Пользователя по электронной почте.</p>\n                    <p>4.1.8. Предоставления Пользователю эффективной технической поддержки при возникновении проблем, связанных с использованием сайта Wallone.</p>\n                    <p>4.1.9. Предоставления Пользователю с его согласия специальных предложений, новостной рассылки и иных сведений от имени сайта Wallone.</p>"],
          "4": ["<h2>5. Способы и сроки обработки персональной информации</h2>\n                    <p>5.1. Обработка персональных данных Пользователя осуществляется без ограничения срока, любым законным способом, в том числе в информационных системах персональных данных с использованием средств автоматизации или без использования таких средств.</p>\n                    <p>5.2. Персональные данные Пользователя могут быть переданы уполномоченным органам государственной власти Российской Федерации только по основаниям и в порядке, установленным законодательством Российской Федерации.</p>\n                    <p>5.3. При утрате или разглашении персональных данных Администрация вправе не информировать Пользователя об утрате или разглашении персональных данных.</p>\n                    <p>5.4. Администрация принимает необходимые организационные и технические меры для защиты персональной информации Пользователя от неправомерного или случайного доступа, уничтожения, изменения, блокирования, копирования, распространения, а также от иных неправомерных действий третьих лиц.</p>\n                    <p>5.5. Администрация совместно с Пользователем принимает все необходимые меры по предотвращению убытков или иных отрицательных последствий, вызванных утратой или разглашением персональных данных Пользователя.</p>"],
          "5": ["<h2>6. Права и обязанности сторон</h2>\n                    <h3>6.1. Пользователь вправе:</h3>\n                    <p>6.1.1. Принимать свободное решение о предоставлении своих персональных данных, необходимых для использования сайта Wallone, и давать согласие на их обработку.</p>\n                    <p>6.1.2. Обновить, дополнить предоставленную информацию о персональных данных в случае изменения данной информации.</p>\n                    <p>6.1.3. Пользователь имеет право на получение у Администрации информации, касающейся обработки его персональных данных, если такое право не ограничено в соответствии с федеральными законами. Пользователь вправе требовать от Администрации уточнения его персональных данных, их блокирования или уничтожения в случае, если персональные данные являются неполными, устаревшими, неточными, незаконно полученными или не являются необходимыми для заявленной цели обработки, а также принимать предусмотренные законом меры по защите своих прав. Для этого достаточно уведомить Администрацию по указаному E-mail адресу.</p>\n                    <h3>6.2. Администрация обязана:</h3>\n                    <p>6.2.1. Использовать полученную информацию исключительно для целей, указанных в п. 4 настоящей Политики конфиденциальности.</p>\n                    <p>6.2.2. Обеспечить хранение конфиденциальной информации в тайне, не разглашать без предварительного письменного разрешения Пользователя, а также не осуществлять продажу, обмен, опубликование, либо разглашение иными возможными способами переданных персональных данных Пользователя, за исключением п.п. 5.2. настоящей Политики Конфиденциальности.</p>\n                    <p>6.2.3. Принимать меры предосторожности для защиты конфиденциальности персональных данных Пользователя согласно порядку, обычно используемого для защиты такого рода информации в существующем деловом обороте.</p>\n                    <p>6.2.4. Осуществить блокирование персональных данных, относящихся к соответствующему Пользователю, с момента обращения или запроса Пользователя, или его законного представителя либо уполномоченного органа по защите прав субъектов персональных данных на период проверки, в случае выявления недостоверных персональных данных или неправомерных действий.</p>"],
          "6": ["<h2>7. Ответственность сторон</h2>\n                    <p>7.1. Администрация, не исполнившая свои обязательства, несёт ответственность за убытки, понесённые Пользователем в связи с неправомерным использованием персональных данных, в соответствии с законодательством Российской Федерации, за исключением случаев, предусмотренных п.п. 5.2. и 7.2. настоящей Политики Конфиденциальности.</p>\n                    <p>7.2. В случае утраты или разглашения Конфиденциальной информации Администрация не несёт ответственность, если данная конфиденциальная информация:</p>\n                    <p>7.2.1. Стала публичным достоянием до её утраты или разглашения.</p>\n                    <p>7.2.2. Была получена от третьей стороны до момента её получения Администрацией Ресурса.</p>\n                    <p>7.2.3. Была разглашена с согласия Пользователя.</p>\n                    <p>7.3. Пользователь несет полную ответственность за соблюдение требований законодательства РФ, в том числе законов о рекламе, о защите авторских и смежных прав, об охране товарных знаков и знаков обслуживания, но не ограничиваясь перечисленным, включая полную ответственность за содержание и форму материалов.</p>\n                    <p>7.4. Пользователь признает, что ответственность за любую информацию (в том числе, но не ограничиваясь: файлы с данными, тексты и т. д.), к которой он может иметь доступ как к части сайта Wallone, несет лицо, предоставившее такую информацию.</p>\n                    <p>7.5. Пользователь соглашается, что информация, предоставленная ему как часть сайта Wallone, может являться объектом интеллектуальной собственности, права на который защищены и принадлежат другим Пользователям, партнерам или рекламодателям, которые размещают такую информацию на сайте Wallone. Пользователь не вправе вносить изменения, передавать в аренду, передавать на условиях займа, продавать, распространять или создавать производные работы на основе такого Содержания (полностью или в части), за исключением случаев, когда такие действия были письменно прямо разрешены собственниками такого Содержания в соответствии с условиями отдельного соглашения.</p>\n                    <p>7.6. В отношение текстовых материалов (статей, публикаций, находящихся в свободном публичном доступе на сайте Wallone) допускается их распространение при условии, что будет дана ссылка на Wallone.</p>\n                    <p>7.7. Администрация не несет ответственности перед Пользователем за любой убыток или ущерб, понесенный Пользователем в результате удаления, сбоя или невозможности сохранения какого-либо Содержания и иных коммуникационных данных, содержащихся на сайте Wallone или передаваемых через него.</p>\n                    <p>7.8. Администрация не несет ответственности за любые прямые или косвенные убытки, произошедшие из-за: использования либо невозможности использования сайта, либо отдельных сервисов; несанкционированного доступа к коммуникациям Пользователя; заявления или поведение любого третьего лица на сайте.</p>\n                    <p>7.9. Администрация не несет ответственность за какую-либо информацию, размещенную пользователем на сайте Wallone, включая, но не ограничиваясь: информацию, защищенную авторским правом, без прямого согласия владельца авторского права.</p>"],
          "7": ["<h2>8. Разрешение споров</h2>\n                    <p>8.1. До обращения в суд с иском по спорам, возникающим из отношений между Пользователем и Администрацией, обязательным является предъявление претензии (письменного предложения или предложения в электронном виде о добровольном урегулировании спора).</p>\n                    <p>8.2. Получатель претензии в течение 30 календарных дней со дня получения претензии, письменно или в электронном виде уведомляет заявителя претензии о результатах рассмотрения претензии.</p>\n                    <p>8.3. При не достижении соглашения спор будет передан на рассмотрение Арбитражного суда г. Чебоксары.</p>\n                    <p>8.4. К настоящей Политике конфиденциальности и отношениям между Пользователем и Администрацией применяется действующее законодательство Российской Федерации.</p>"],
          "8": ["<h2>9. Дополнительные условия</h2>\n                    <p>9.1. Администрация вправе вносить изменения в настоящую Политику конфиденциальности без согласия Пользователя.</p>\n                    <p>9.2. Новая Политика конфиденциальности вступает в силу с момента ее размещения на сайте Wallone, если иное не предусмотрено новой редакцией Политики конфиденциальности.</p>\n                    <p>9.3. Все предложения или вопросы касательно настоящей Политики конфиденциальности следует сообщать по адресу: admin@wallone.ru</p>\n                    <p>9.4. Действующая Политика конфиденциальности размещена на странице по адресу https://wallone.ru/privacy_statement</p>"],
        }
      },
      pageIndex: 0
    }
  },
  mounted() {
    useHead({
      title: `Wallone • Красивые изображения на рабочий стол`
    })
    // this.loaded()
  },
  methods: {
    setPage(index) {
      return parseInt(index) + 1
    }
    // loaded() {
    //   let vm = this
    //   apiRouter.getRequest(`https://dev.w2me.ru/api/v1/privacy_statement`).then(function (response) {
    //     vm.data = response.data
    //   })
    // }
  }
}
</script>

<style lang="sass" scoped>
@import "@/assets/style/variables"
@import "@/assets/style/fonts"

.card, .card-footer
  background: $componentColor
  border: 0

.card
  height: 560px

.card-body
  @extend %default

.bg-component
  background: $componentColor

.date-updated
  color: $primary2

</style>
